# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение. При вызове
# функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и
# до n!.

# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
from functools import reduce


def fact(num):
    for elem in range(1, num + 1):
        num_list = list(range(1, elem + 1))
        yield reduce(lambda x, y: x * y, num_list)


n = 5
i = 1
for el in fact(n):
    print(f'Факториал числа {i}: {el}')
    i += 1
